the/org/the-modeline.org
* Modeline Configuration
** Requirements                                                   :noexport:
#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-
  ;;; the-modeline.el --- Modeline configuration

  (require 'the-package)
#+end_src
** Diminish
=diminish= allows us to change the display of minor modes in the
modeline. I prefer Delight, but =diminish= is the standard used by
many packages.
#+begin_src emacs-lisp
  (use-package diminish
    :demand t
    :config
    (with-eval-after-load 'subword
      (diminish 'subword-mode))
    (diminish 'filladapt-mode)
    (with-eval-after-load 'outline
      (diminish 'outline-minor-mode))
    (diminish 'smerge-mode)
    (diminish 'whitespace-mode)
    (diminish 'abbrev-mode)
    (diminish 'auto-fill-function)
    (with-eval-after-load 'page-break-lines
      (diminish 'page-break-lines-mode))
    (diminish 'visual-line-mode "ω")
    (diminish 'eldoc-mode "ε")
    )
#+end_src
** Delight
=delight= allows us to change the display of minor and major modes in
the modeline. Spaceline is gonna do a lot of this work for us, but for
anything it doesn't catch we'll make our own lighter. This also gives
us the =:delight= keyword in our =use-package= declarations.

#+begin_src emacs-lisp
  (use-package delight
    :demand t
    :config
    (delight
     '((emacs-lisp-mode "ξ" :major))))
#+end_src
** Nyan!
Gotta have that cat! This will add a Nyan Cat progress indicator to
the modeline.
#+begin_src emacs-lisp
  (use-package nyan-mode
    :demand t
    :init
    (setq nyan-animate-nyancat t
          nyan-wavy-trail t)
    :config
    (nyan-mode 1))
#+end_src
** TODO Custom Modeline
#+begin_src emacs-lisp
  (use-package spaceline
    :init
    (require 'spaceline-config)
    :config
    (spaceline-spacemacs-theme))
#+end_src
** Provides                                                       :noexport:
#+begin_src emacs-lisp
  (provide 'the-modeline)

  ;;; the-modeline.el ends here
#+end_src
